---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.CategoryId
source: html/8b101e05-e4b0-429e-1c6a-8ef2d8682581.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.CategoryId Property

The category id of pipe curves. It will be OST_PipeCurves, OST_FlexPipeCurves, or OST_PlaceHolderPipes.

## Syntax (C#)
```csharp
public ElementId CategoryId { get; }
```